## 뮤텍스(Mutex)와 세마포어(Semaphore)
### 뮤텍스
* 초기값을 0과 1로 가진다.
* 임계영역에 들어갈 때 `락(lock)`을 걸어 다른 프로세스(혹은 스레드)가 접근하지 못하도록 하고, 임계영역에서 나와 해당 락을 `해제(unlock)`한다.

### 세마포어
* 정수 값을 가지는 변수
  * 정수 값: 접근할 수 있는 최대 허용치 만큼 동시에 사용자 접근을 할 수 있게 함
* 종류
  * 카운팅 세마포어(counting semaphore)
    * 세마포어의 초기값이 0 이상의 수
  * 이진 세마포어(binary semaphore)
    * 세마포어의 초기값이 0 또는 1
    
### 공통점
* 여러 프로세스나 쓰레드가 공유 자원에 접근하는 것을 제어하기 위한 방법
* 즉, 병행 처리를 위한 프로세스 동기화 기법

### 차이점
* 세마포어는 공유 자원에 **세마포어의 변수만큼의 프로세스(또는 쓰레드)가 접근**할 수 있다. 반면에 뮤텍스는 **오직 1개만의 프로세스(또는 쓰레드)만 접근**할 수 있다.
* 현재 수행중인 프로세스가 아닌 **다른 프로세스가 세마포어를 해제**할 수 있다. 하지만 뮤텍스는 **락(lock)을 획득한 프로세스가 반드시 그 락을 해제**해야 한다.

> 이 글은 https://velog.io/@conatuseus/OS-%EC%84%B8%EB%A7%88%ED%8F%AC%EC%96%B4%EC%99%80-%EB%AE%A4%ED%85%8D%EC%8A%A4 를 바탕으로 작성되었습니다.
